docs/posts/2017-04-13-maundy-thursday.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thoughts on Maundy Thursday</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Thoughts on Maundy Thursday</h1>
<p class="subtitle" role="doc-subtitle">Apr 13, 2017</p>
</header><p>
This day of the church calendar, Maundy Thursday, gets its name from John 13:34, which, in the Latin Vulgate, begins with &ldquo;mandatum novum&rdquo; — a new commandment. After washing the feet of the disciples earlier in chapter 13, Jesus told them,
</p>

<blockquote>
<p>
I give you a new commandment, that you love one another. Just as I have loved you, you also should love one another. By this everyone will know that you are my disciples, if you have love for one another.
</p>
</blockquote>

<p>
A commandment to love, though, should strike us as odd, because we generally think of love as a feeling or emotion. It makes no sense to command a feeling or emotion, however, for those are not within our immediate control. We can only be commanded to act. So, unless Jesus&rsquo; command is simply pointless, love must be a way of acting, or living as Jesus lived; in his words, &ldquo;For I have set you an example, that you also should do as I have done to you.&rdquo; (John 13:15)
</p>

<p>
I have good reason to continue to think of love as just an emotion. By thinking of love as a feeling, I avoid having to keep the commandment to love. So, I have taken something that I simply do not want to do, and turned it into something that is impossible for me to do. As long as I pretend it is impossible, I can deny that there is any obligation to keep the commandment. That way, I can go on loving only those whom I like, and thus continue to rest comfortably in my own self-righteousness.
</p>

<p>
May God forgive me.
</p>



<div class="tagline" id="org1196902">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
